## Staging: dns
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 2 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                               NAME                                |
|--------|-------------------------------------------------------------------|
| add    | `aws_route53_record.staging-custom-domain-aws-ses-sandbox-TXT[0]` |
|        | `aws_route53_record.staging-custom-domain-ses-sandbox-TXT[0]`     |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_route53_record.staging-custom-domain-aws-ses-sandbox-TXT[0] will be created
  + resource "aws_route53_record" "staging-custom-domain-aws-ses-sandbox-TXT" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_amazonses.custom-sending-domain.staging.notification.cdssandbox.xyz"
      + records         = [
          + "fXT/J45wZcUoBSnJAwPyfnHVf5E2b7aNayCC5PeQltg=",
        ]
      + ttl             = 300
      + type            = "TXT"
      + zone_id         = "Z04028033PLSHVOO9ZJ1Z"
    }

  # aws_route53_record.staging-custom-domain-ses-sandbox-TXT[0] will be created
  + resource "aws_route53_record" "staging-custom-domain-ses-sandbox-TXT" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "custom-sending-domain.staging.notification.cdssandbox.xyz"
      + records         = [
          + "amazonses:fXT/J45wZcUoBSnJAwPyfnHVf5E2b7aNayCC5PeQltg=",
        ]
      + ttl             = 300
      + type            = "TXT"
      + zone_id         = "Z04028033PLSHVOO9ZJ1Z"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.production_dns_manager[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.scratch_dns_manager[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.staging_dns_manager[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.notification-sandbox[0]"]

21 tests, 17 passed, 4 warnings, 0 failures, 0 exceptions

```

</details>
